{
    "version": "https://jsonfeed.org/version/1",
    "title": "Spencer Sharp",
    "feed_url": "undefined/rss/feed.json",
    "description": "Your blog description",
    "icon": "undefined/favicon.ico",
    "author": {
        "name": "Spencer Sharp"
    },
    "items": [
        {
            "id": "undefined/articles/paper/published",
            "content_html": "<ul>\n<li>\n<p>Chenyang Zhou, Guobing Zou, Shengxiang Hu, Hehe Lv, Liangrui Wu and Bofeng Zhang, “Dual-Graph Convolutional Network and Dual-View Fusion for Group Recommendation”. The 28th Pacific-Asia Conference on Knowledge Discovery and Data Mining(PAKDD), 2024. (CCF-C)</p>\n</li>\n<li>\n<p>Guobing Zou, Liangrui Wu, Shengxiang Hu, Song Yang, Chenyang Zhou, YanglanGan, Bofeng Zhang. “User Profiling for Personalized Service Recommendation with Dual High-order Feature Learning”. The 31th IEEE International Conference on Web Services (ICWS), 2024. (CCF-B)</p>\n</li>\n<li>\n<p>Hehe Lv, Guobing Zou, Bofeng Zhang, Shengxiang Hu, Chenyang Zhou and Liangrui Wu, “Dynamic Bipartite Network Prediction Model Based on Structure and Preference Features”. Knowledge and Information Systems, 2024. (CCF-B)</p>\n</li>\n<li>\n<p>Shengxiang Hu, Bofeng Zhang, Hehe Lv, Furong Chang, Chenyang Zhou, Liangrui Wu and Guobing Zou, “Improving Network Representation Learning via Dynamic Random Walk, Self-Attention and Vertex Attributes-Driven Laplacian Space Optimization”. Entropy, 2022. (SCI三区)</p>\n</li>\n</ul>",
            "url": "undefined/articles/paper/published",
            "title": "论文汇总",
            "summary": "研究生期间主要研究方向是图神经网络、推荐系统、群组推荐、对比学习等方向，以第一作者身份发表会议论文1篇，同时参与论文发表3篇。",
            "date_modified": "2024-05-07T00:00:00.000Z",
            "author": {
                "name": "Spencer Sharp"
            }
        },
        {
            "id": "undefined/articles/work/decoda",
            "content_html": "<p>从2023年9月加入decoda.ai, 是怀着创业的热情和激情，是全力投身在其中的；站在广袤的十字路口上，全面拥抱大模型这一股浪潮。\n每天通勤的三小时，在地铁上会挤出时间，看各种商业相关文章，寻找方向，认识市场和用户；会坐着最后一班地铁回到学校大门，发现室友早已上床休息，脑中仍然会思考代码逻辑的实现，产品功能的设计；从0搭建的产品，第一天上线后有了用户付费的喜悦，至今是难以忘怀的；半夜两点出现bug，立马oncall改代码，体会程序员不容易。</p>\n<p>从开始代码不规范，单纯实现功能而已；到现在追求代码的简洁、复用、优美，不断追求完美，考虑到更多方面。在大家指导下，逐渐变得可以独挡一面，完成复杂的功能设计和服务。</p>\n<h2>产品：</h2>\n<h3>Your Fantasy AI</h3>\n<p>这是我参与的第一款产品，基于discord平台和大模型，提供相应情绪价值服务，主要包含互动交互故事、角色扮演聊天、好感度服务开发周期：2023.10--2024.3，作为公司验证市场的一个小产品，通过用户的反馈进一步理解市场的需求。</p>\n<h4>担任角色：是最早负责该项目的工程化，实现聊天的功能，随后不断完善聊天和丰富其他的功能。代码量：95commits，20000+代码变动。</h4>\n<h4>工作内容：</h4>\n<ul>\n<li>prompt的设计和调整：为了达到沉浸式的聊天内容体验，符合人物性格，需要反复调整和设计prompt的内容和构造。</li>\n<li>图片检索服务：保证图片和发送内容上下文具有一定的匹配度，将图片和文字转化为向量进行相似度匹配，利用chromadb提供检索服务。</li>\n<li>交互故事机器人：设计交互式剧本的读取和转化，根据不同内容产生相应的选项和故事情节。</li>\n<li>好感度属性：判断用户聊天内容和角色性格之间匹配度，并且根据内容进行调整变化。</li>\n</ul>\n<h3>Dreamle.ai</h3>\n<p>是我参与的第二个产品开发任务，通过第一个产品验证市场的需求，随后着重开发自身的平台服务，web端和移动端。产品的重点是无限制内容的情感陪伴，主要提供多模态的聊天服务，支持图片发送；查看角色的朋友圈和Post；提供图片生成、图片收集和解锁功能；排行榜显示用户的交互，宝石积分系统等服务。总体来说是功能相对丰富完整的产品，主要开发周期大致3个月时间。</p>\n<h4>担任角色：全栈工程师（后端核心开发和前端开发），后端上负责核心的聊天、长期记忆等涉及聊天核心业务开发，总代码量为：5000+代码改动；前端主要负责排行榜展示和图片生成页面，总代码量：10000+改动。</h4>\n<h4>后端：</h4>\n<ul>\n<li>聊天业务：负责聊天室的CRUD以及聊天内容生成；设计prompt的构造，保证聊天内容的一致性；根据不同大模型调整参数</li>\n<li>首页推荐：设计首页的bot排序和推荐算法，满足不同用户根据tags推荐感兴趣角色</li>\n<li>memory服务：提供将用户和角色聊天记录导出公布，同时加载其他用户memory作为自身聊天记录</li>\n<li>长记忆：角色聊天保持长期记忆，因此设计记忆存储的RAG服务，提供检索、存储、总结和删除记忆的功能，保证聊天记忆拓展</li>\n<li>图片检索：设计图片发送的流程事件，同时图片内容检索的RAG服务，保证聊天过程图文一致性</li>\n</ul>\n<h4>前端：</h4>\n<ul>\n<li>排行榜页面：根据用户和角色交互数据统计，将数据进行展示；同时根据用户的成就进行结算</li>\n<li>图片制作页面：按照步骤选择对应模型、tag后生成图片，实现对图片进行保存、下载功能</li>\n<li>角色卡片：实现角色卡片的设计和交互实现，同时针对不同细节优化。</li>\n</ul>",
            "url": "undefined/articles/work/decoda",
            "title": "Decoda.ai(google团队)  算法工程师",
            "summary": "Decoda.ai是由google工程师和北美教授成立的大模型初创公司，于2023.9.1加入团队，担任算法工程师，核心参与和开发两款大模型产品应用。",
            "date_modified": "2023-09-01T00:00:00.000Z",
            "author": {
                "name": "Spencer Sharp"
            }
        },
        {
            "id": "undefined/articles/internship/ali",
            "content_html": "",
            "url": "undefined/articles/internship/ali",
            "title": "大模型推理优化  软通动力有限公司(外派阿里云)",
            "summary": "参与阿里云震旦异构平台相关推理性能优化、编译优化等高性能开发工作；了解Megatron、FastTransformer等框架参与大模型的推理优化与加速，部署分布式环境、进行分布式推理；调研和整理目前大模型推理优化前沿论文。",
            "date_modified": "2023-05-05T00:00:00.000Z",
            "author": {
                "name": "Spencer Sharp"
            }
        },
        {
            "id": "undefined/articles/school/shu",
            "content_html": "<p>本人于2021.9至2024.6在上海大学攻读硕士研究生，专业为计算机应用与技术，研究方向：图神经网络、推荐系统、对比学习；实验室为SCDM实验室。读研和做科研是孤独的，是需要坚持不懈的，硕士三年期间经历很多，记录一下这三年的成长和变化。</p>\n<h2>三年记录：</h2>\n<ol>\n<li>2021年9月，加入scdm实验室，和实验室师兄师姐一起给导师准备礼物，合影留念。</li>\n<li>2021年10月，加入学院篮球院队，和大家一起打球🏀，随队获得季军。</li>\n<li>2021年10月，开始参加组内项目，在消防系统项目中担任前端工作；2021年12月外派去大专家.com进行前端项目的实习工作。</li>\n<li>2022年1月，和室友们一起过生日，彼此越来越熟悉，逐渐变成兄弟。</li>\n<li>2022年3月，学校开始防疫工作，第一时间报名志愿者，期间担任物资志愿者，维护秩序志愿者，寝室层长志愿等。</li>\n<li>2022年5月，开始在学校尝试新的运动，接触了飞盘🥏、棒球⚾️、滑板🛹，并喜欢上飞盘运动。</li>\n<li>2022年7月，参与国家科技部重点项目，担任区块链技术开发工程师。</li>\n<li>2022年9月，担任文艺部部长，复杂举办学校各种文艺演出：开学典礼、十佳歌手等等，虽然很忙收获了好多真挚难忘的记忆。</li>\n<li>2022年9月，“夏天”到我们的家里，成为新的一员，给家里带来了很多欢乐。</li>\n<li>2023年2月，论文完成初稿，虽然经历过几次拒稿，但最终成功发表（很不容易）。</li>\n<li>2023年5月，和实验室大家团建去常州，留下许多高校有趣的瞬间。</li>\n<li>2023年5月，去上海阿里云实习，开始研究生第一份正式的实习工作，关于代码规范和技术开发有进一步提升。</li>\n<li>2023年6月，作为助班回本科学校参加毕业典礼，感慨时间太快，一转眼自己带的小朋友也毕业了。</li>\n<li>2023年7月，参加2023年世界人工智能大会，感叹大模型时代之后AI的蓬勃发展。</li>\n<li>2023年7月，第一次和朋友去日本旅行，两周的特种兵之旅深入了解日本风景和民俗。</li>\n<li>2023年9月，加入decoda.ai, 内心之中一直有一股创业的热情，大模型来了就全力拥抱它，充斥的激情准备大干一场。</li>\n<li>2023年9月，期间参加了许许多多会议：GOSIM、微软开发者之日、亚马逊黑客松比赛、2050等，不断学习和交流。</li>\n<li>2023年10月，作为导游欢迎实验室大家来嘉兴团建游玩，向大家介绍了自己家乡。</li>\n<li>2023年3月，一个人去吉林滑雪🎿，抓住最后学生的身份，体验滑雪快乐。</li>\n<li>2023年5月，论文完成初稿，经过师兄和导师的指导，不断修改；盲审通过，顺利的毕业了🎓。</li>\n<li>2023年6月，和室友们去云南毕业旅游，随后最后一个从311寝室离开了😭。</li>\n</ol>\n<p>期间和大家看过很多音乐演出，和朋友们聚过很很多次餐，一起给室友过了三年的生日，实验室大家一起去团建，把这些美好的记忆留在了一张张照片里；同时也感叹自己开始到岁数，身体的机能下降，同学们陆续结婚。三年之中，只是作为一个像大多数人一样的普通学生，没有十分傲人的成绩，有的只是在热爱生活，对待好自己每一件事。</p>\n<h2>荣誉：</h2>\n<ul>\n<li>校研究生联合会文艺部部长，优秀部长；计算机工程与科学学院学术部干事</li>\n<li>连续两年获得校级奖学金、2022学年荣获一等奖学金</li>\n<li>荣获2021-2022学年优秀学生干事、校级优秀学生、优秀志愿者的称号</li>\n<li>曾获2021、2022年全国“华为杯”数学建模竞赛三等奖</li>\n</ul>\n<img alt=\"Example Image\" classname=\"\" srcSet=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fportrait1.794c40cc.jpg&amp;w=640&amp;q=75 1x, /_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fportrait1.794c40cc.jpg&amp;w=828&amp;q=75 2x\" src=\"/_next/image?url=%2F_next%2Fstatic%2Fmedia%2Fportrait1.794c40cc.jpg&amp;w=828&amp;q=75\" width=\"400\" height=\"300\" decoding=\"async\" data-nimg=\"1\" loading=\"lazy\" style=\"color:transparent\"/>",
            "url": "undefined/articles/school/shu",
            "title": "上海大学 硕士",
            "summary": "2021年9月至2024年6月在上海大学SCDM实验室攻读硕士学位，研究方向为推荐系统。",
            "date_modified": "2021-09-01T00:00:00.000Z",
            "author": {
                "name": "Spencer Sharp"
            }
        },
        {
            "id": "undefined/articles/internship/nanhulab",
            "content_html": "",
            "url": "undefined/articles/internship/nanhulab",
            "title": "大数据操作系统开发  嘉兴市南湖实验室",
            "summary": "南湖实验室是是由嘉兴市人民政府举办、北京大数据先进技术研究院合作共建的全国唯一高能级科研平台。实习期间协助湖仓一体数据湖洞察系统开发、设计对象存储接口；实现数据湖存储管理和系统监控功能，多元数据传输。",
            "date_modified": "2021-07-01T00:00:00.000Z",
            "author": {
                "name": "Spencer Sharp"
            }
        },
        {
            "id": "undefined/articles/school/cjlu",
            "content_html": "<p>本人于2017.9至2021.6在中国计量大学攻读学士学位，专业为计算机科学与技术。刚进入大学仍然的青涩，充满了期待，些许留下了许多记忆。</p>\n<h2>记录：</h2>\n<ol>\n<li>最喜欢210寝室的每周影院，大家去楼下超市买一些零食，放下手机，围坐在一起观看🎬，看完之后一起讨论剧情。</li>\n<li>在寝室中经常会玩一些桌游和扑克♠️：阿瓦隆、不要做挑战、炸金花、斗地主、炸弹猫、谁是卧底等，玩到最后总是充满快乐。</li>\n<li>记得俄罗斯世界杯，和大家一起投屏观看，还特地熬夜去了酒吧，看完之后去钱塘江边看日出🌄。</li>\n<li>担任了助理班主任，随后认识了其他可爱有趣的小伙伴以及最最亲切的辅导员。</li>\n<li>为了尝试新事物，加入了舞团，大二的暑期集训，随后表演了大型舞台剧《千秋计量》；是自己一次勇敢的尝试。</li>\n<li>毕业旅行和室友一起去了西安，喜欢坐着绿皮火车🚄，看着沿途风景的感觉。</li>\n<li>参与了许许多多的志愿服务，去乌镇参加了世界互联网大会的志愿者。</li>\n<li>大一参加了许多学生活动，可以独立去策划一些活动，让我觉得很兴奋。</li>\n<li>用省政府奖学金的钱给自己买了一台相机，开始接触摄影。</li>\n</ol>\n<p>在本科期间所认识的人都特别友好亲切，一直觉得在大学中需要不断尝试新的事物，自己也逐渐走出舒适区，学习了很多之前没有接触的。我的大学时光是充实的，是丰富的，是普通的，不后悔的。</p>\n<h2>荣誉：</h2>\n<ul>\n<li>2021年浙江省优秀毕业生、校级优秀毕业生</li>\n<li>助理班主任、校联合会外联部干事、益微青年支教成员、党员之家办公室主任</li>\n<li>2018-2019、2019-2020学年浙江省政府奖学金；优秀学生一等奖学金、学业奖学金</li>\n<li>2020年浙江省大学生高等数学竞赛一等奖、全国大学生数学竞赛一等奖</li>\n<li>第六届世界互联大会志愿者、2019年浙江省大学生艺术节甲组一等奖</li>\n</ul>",
            "url": "undefined/articles/school/cjlu",
            "title": "中国计量大学   本科",
            "summary": "2017年9月至2021年6月在中国计量大学攻读本科学位，研究方向为图像识别、行人再识别。",
            "date_modified": "2017-09-01T00:00:00.000Z",
            "author": {
                "name": "Spencer Sharp"
            }
        }
    ]
}